[
  {
    "title": "\"Jira as a project management tool\"",
    "body": "5/5What do you like best about Jira?At work we use Jira in combination with COnfluence and Jira Service Management. We use it for our development teams to manage their work and for project management. Its easy to use and implement from project creation to using Jira you can be up and running in 30 mins or less. It integrates well with other tools such as octopus and github. All the teams use it daily and the support when needed is there. Review collected by and hosted on G2.com.What do you dislike about Jira?The only downside which is the same with any SaaS product you dont own is customisation and features if you need them you need to find, comment and vote the tickets for the feature and it may or may not be implemented. But this is not at all a slight on Jira as all 3rd party products tend to be like that you have to hope they put it on the roadmap and wait for implentation. In terms of Jira lots of features are being put out regularly which is great just hard to keep up sometimes. Review collected by and hosted on G2.com.What problems is Jira solving and how is that benefiting you?Project Management \nThe kanban boards make it easy Review collected by and hosted on G2.com.\nShow More",
    "rating": "5.0",
    "author": "Helen C.",
    "date": "2025-08-06"
  },
  {
    "title": "\"Long time JIRA user, new to Product Discovery and I love it!\"",
    "body": "5/5What do you like best about Jira?I recently started using JIRA's new Product Discovery feature and it has truly transformed our team's product planning. The seamless integration with JIRA and Confluence is a game changer, offering us real-time visibility across projects. This has greatly improved our workflow efficiency and team alignment, enabling us to make better decisions quickly. With an intuitive interface and robust functionalities, it's a must-have for any team aiming for success. Review collected by and hosted on G2.com.What do you dislike about Jira?While I appreciate the depth of customization, I do tend to forget all of the ways to make fields display in locations that I need them, where or how to edit schemes and screens and workflows and to make them correctly apply to the right projects and ticket types. Review collected by and hosted on G2.com.What problems is Jira solving and how is that benefiting you?The seamless integration of Product Discovery with JIRA and Confluence is a game changer, offering us real-time visibility across projects. This has greatly improved our workflow efficiency and team alignment, enabling us to make better decisions quickly. Review collected by and hosted on G2.com.\nShow More",
    "rating": "5.0",
    "author": "Jenni R.",
    "date": "2025-08-05"
  },
  {
    "title": "\"Powerful but Complex Platform for Agile Project Management\"",
    "body": "4.5/5What do you like best about Jira?Jira offers a rich set of agile-focused features like customizable Scrum and Kanban boards, detailed issue tracking, and reporting dashboards. The flexibility to tailor workflows to fit unique team processes is incredibly valuable, especially for complex software projects. Jira is a central tool for task tracking and team collaboration so use it everyday. Review collected by and hosted on G2.com.What do you dislike about Jira?The biggest challenge is ease of use. For new users, Jira can feel overwhelming because the interface has many options and settings that aren’t always intuitive. Even experienced users can struggle with configuring complex workflows or permissions. Customer support is generally responsive and helpful, but sometimes documentation doesn’t cover edge cases. The ease of implementation is not that good if you need to migrate data, integrate other tools, or customize workflows. Review collected by and hosted on G2.com.What problems is Jira solving and how is that benefiting you?Jira helps streamline project tracking, prioritize work effectively, and improve visibility across development teams. It reduces confusion around task ownership and deadlines while enabling better coordination between developers, testers, and product managers. By centralizing all project activities in one place, Jira improves transparency and team accountability. Review collected by and hosted on G2.com.\nShow More",
    "rating": "4.5",
    "author": "Anoop  J.",
    "date": "2025-08-05"
  },
  {
    "title": "\"Jira for Project Management\"",
    "body": "5/5What do you like best about Jira?It is very easy to work with Jira, additionally one can set up automations that take care of cumbersome or repetitive tasks. I use it on a daily basis to manage my own work and to check the progress of the teams and projects. It is integrated with our ticketing system so that the Customer Assistance team can assign work to the Development team. Review collected by and hosted on G2.com.What do you dislike about Jira?It can be challenging to set up Jira correctly for Hybrid and Classic project management methodologies. Review collected by and hosted on G2.com.What problems is Jira solving and how is that benefiting you?We use Jira for both \"run the business\" and \"change the business\".\nIn the \"run the business\" part Jira is used for bug tracking, it is integrated with our ticketing system and it is how the Customer Assistance team (first level support) assigns work or requests support from specialized technical teams, such as the Development team (second level support).\nIn the \"change the business\" part, we use Jira to plan and manage projects, and also for product management, for the products created by our internal developers. Review collected by and hosted on G2.com.\nShow More",
    "rating": "5.0",
    "author": "Hugo S.",
    "date": "2025-08-05"
  },
  {
    "title": "\"Solid tool to keep track of complex projects\"",
    "body": "5/5What do you like best about Jira?I've been using Jira daily for the last couple years, and what started as a tool that felt overwhelming has become pretty essential for keeping our projects coordinated.\n\nThe customizable workflows are probably the biggest win - we've set up processes that match how we actually work, not some generic template. Nevertheless we created some standard solutions as well that suits us the best.\n\nThe integrations and Atlassian ecosystem make a huge difference too. Our Gitlab commits link directly to tickets, and the Slack notifications keep everyone in the loop without being annoying. The automation rules have eliminated a lot of busy work - status updates, assignee changes, and notifications all happen without us having to remember to do them.\n\nPlanning boards and the reporting gives us actual data to work with instead of just gut feelings about how we're doing. I can just pull it up and see exactly who's working on what without having to ask everyone \"so what are you doing today?\" Review collected by and hosted on G2.com.What do you dislike about Jira?Interface complexity is real - new team members consistently struggle for their first few weeks, and I find myself constantly training people on \"where to find things.\"  Recent UI changes didn't help either.  I get that they're trying to improve things, but it definitely disrupted our workflow for a while.\n\nI'd love to see them add more AI features - being able to quickly ask \"what tickets need my attention today?\" would be incredibly useful. Review collected by and hosted on G2.com.What problems is Jira solving and how is that benefiting you?Jira helps to have centralized visibility into everything. We can see bottlenecks forming before they become serious problems, track how our estimates compare to actual work, and give stakeholders realistic timelines instead of just guessing.\n\nThe cross-team collaboration has improved significantly. Designers know exactly what developers need, QA can prepare for incoming work, and product managers can make informed decisions about priorities. The audit trail is also invaluable when we need to trace back through changes or understand why certain decisions were made.\n\nThe comprehensive audit trail functionality has proven invaluable for troubleshooting and root cause analysis. When production issues arise, we can efficiently trace back through all changes and modifications, significantly reducing our investigation time. The reporting capabilities have also enabled us to identify process optimization opportunities and resource allocation inefficiencies that would have otherwise gone unnoticed.\n\nThe audit trail and history functionality are also really valuable - when there are some issues, we can quickly trace back through the history to see exactly what changed and when. This has saved us significant time in troubleshooting and root cause analysis. Review collected by and hosted on G2.com.\nShow More",
    "rating": "5.0",
    "author": "Elena V.",
    "date": "2025-08-04"
  },
  {
    "title": "\"Powerful tool for agile project management\"",
    "body": "4.5/5What do you like best about Jira?Jira is a very powerful and flexible system will dozens of plugins and integrations with third-party tools which allow us to effectively plan, monitor and improve our development processes over time. It is hard to find a competing product which offers as much functionality and third-party integrations. Review collected by and hosted on G2.com.What do you dislike about Jira?While Jira is very customisable, it is a bit complicated to manage in the backend. As a Jira administrator, there is definitely room for improvement in terms of how Jira systems can be managed. However, Atlassian have been introducing a flurry of improvements to their tools over the past few months and I believe the Jira admin centre is next on their list. Review collected by and hosted on G2.com.What problems is Jira solving and how is that benefiting you?Jira enables us to effectively plan and monitor our development tasks. It also provides insights into the productivity of developers and the speed at which we can deliver meaningful value within the organisation. Atlassian's tight integration between the other tools on offer such as Atlassian Home Projects/Goals, Compass, Jira Service Management and Confluence are highly useful to create a single source of truth for managers, stakeholders and developers alike. Review collected by and hosted on G2.com.\nShow More",
    "rating": "4.5",
    "author": "Richard T.",
    "date": "2025-08-05"
  },
  {
    "title": "\"Is jira worth the hype? an honest user perspective.\"",
    "body": "5/5What do you like best about Jira?Seamless integration as it connects effortlessly with tools like slack confluence and many more making it central hub for development and collaboration without constant app switching.\nI love the real time insights customizable reports and visual boards that help track progress.\n\nCollaboration feature things like comment mentions and shared backlog foster team communication especially in remote or disturbed setup Review collected by and hosted on G2.com.What do you dislike about Jira?One of the biggest dislike is how complex jira can feel especially for new users or non technical teams as the interface includes a ton of tab menu buttons and specialized jargons like sprint and epic.\nSlow performance and loading time as jira becomes slow particularly when loading issue running queries or handling large instance .\n\nCost and accessibility issue as for smaller team or startup jira can be costly as it cost high for standard plan which might not justify the value of we don't need all the advance feature Review collected by and hosted on G2.com.What problems is Jira solving and how is that benefiting you?For me while working without jira feels very disorganised as before jira team often struggles with managing task using spreadsheets email or different tools leading to miscommunication and missed deadlines jira centralized tak tracking allowing teams to create assign and monitor issue in one place .\n\nAs it resolve the issue for lack of visibility as in complex projects it's hard to know who is working on what and how far the progress is made jira provides transperancy.\n\nAs team especially distributed ones need a way to collaborate seamlessly jira facilitates this bh integrating comments attachment and notification within issue. Review collected by and hosted on G2.com.\nShow More",
    "rating": "5.0",
    "author": "Nayan Mani  D.",
    "date": "2025-08-04"
  },
  {
    "title": "\"Great for keeping complex projects organized and moving\"",
    "body": "4.5/5What do you like best about Jira?Jira helps our team stay super organized, it’s like a central command center for everything we’re working on. I love how easy it is to break work down into epics and tasks, assign things out, and keep an eye on progress. \nIt is the best way I have found internally to manage bigger projects across different teams, and retain traceability and accountability for work. It connects well with the tools we use day-to-day, like Slack and Confluence, which makes life easier. Review collected by and hosted on G2.com.What do you dislike about Jira?It can definitely be a bit overwhelming when you’re just getting started. Some things aren’t super intuitive at first (like writing filters or setting up new workflows), and big boards can sometimes lag. Once you get the hang of it, it’s great,  but a smoother onboarding experience would really help new users. Review collected by and hosted on G2.com.What problems is Jira solving and how is that benefiting you?Tracking of KRs and the required milestones and work associated with that. This in turn assists us in both weekly, monthly and quarterly prioritisation to ensure we are still on target for hitting our big goals for the year. \nIt also enhances transparency for both management and our stakeholders. Review collected by and hosted on G2.com.\nShow More",
    "rating": "4.5",
    "author": "Danie D.",
    "date": "2025-08-04"
  },
  {
    "title": "\"Should be your go-to PM tool\"",
    "body": "4.5/5What do you like best about Jira?As a regular Jira user, I really appreciate how it provides structure and visibility to our workflows. It’s excellent for dividing complex projects into actionable tasks, assigning responsibilities, and tracking progress in real-time. The customizable workflows, easy task prioritization, and built-in reports make it perfect for Agile teams. I also like the smooth integrations with tools like Confluence and Slack, along with the automation features that reduce repetitive work. Jira helps keep everyone on the same page, accountable, and moving forward. This makes project management simpler and more transparent. Review collected by and hosted on G2.com.What do you dislike about Jira?While Jira is powerful, it can feel overwhelming at times, especially with its complex interface and the steep learning curve for new users. Setting up workflows or custom fields often requires admin help, and even small changes can be buried under layers of settings. Sometimes, the system feels a bit sluggish with large projects or too many open issues. If not managed well, boards can quickly become cluttered and hard to navigate. Overall, it's a great tool, but it needs proper management to avoid becoming chaotic. Review collected by and hosted on G2.com.What problems is Jira solving and how is that benefiting you?Jira solves the issue of scattered task management and poor project visibility. It gathers everything—tasks, timelines, priorities, and team responsibilities—into one location. For me, this means fewer status meetings, improved collaboration, and clear accountability. It also helps manage sprints, track progress, and spot blockers early. By centralizing updates and communication, Jira reduces confusion and keeps everyone on the same page. It’s particularly useful in fast-moving projects where transparency and structure are essential for delivering on time. Review collected by and hosted on G2.com.\nShow More",
    "rating": "4.5",
    "author": "Apurva S.",
    "date": "2025-08-04"
  },
  {
    "title": "\"Jira: Project tracking, bug hunting.\"",
    "body": "4.5/5What do you like best about Jira?The best thing about this product is Jira excels at tracking issues, managing workflows, and fostering team collaboration. Its customizable features and integrations make it adaptable to various project needs, improving efficiency and transparency. Review collected by and hosted on G2.com.What do you dislike about Jira?One thing which i can can be a issue is Jira can be complex and slow, with a steep learning curve. It can also be expensive, especially for smaller teams. Review collected by and hosted on G2.com.What problems is Jira solving and how is that benefiting you?It is a comprehensive project management and issue-tracking software which we used  in software development. It empowers teams to effectively plan, track, and manage their work through customizable workflows, agile methodologies like Scrum and Kanban, and robust issue-tracking capabilities. Key features include bug tracking, task management, feature requests, roadmapping, sprint planning, release management, team communication, task assignment, progress tracking, and customizable dashboards and reports. It's versatility and seamless integrations with other tools make it an invaluable asset for teams of all sizes striving for increased efficiency and improved project outcomes. Review collected by and hosted on G2.com.\nShow More",
    "rating": "4.5",
    "author": "Nikhil K.",
    "date": "2025-07-31"
  }
]